/**
 * The rand7() API is already defined for you.
 * var rand7 = function() {}
 * @return {number} a random integer in the range 1 to 7
 */
let rand7 = () => {
  return Math.ceil(Math.random() * 7);
};
//
//这个题目的难度在于如何产生均匀随机数？
//首先是rand7只能产生0到7的随机数，所以至少要两次rand7才能，所以我们在此做出如下排列组合，即
//     1    2   3   4   5   6   7  y轴             1    2   3   4   5   6   7
//0    1    2   3   4   5   6   7             0    1    2   3   4   5   6   7
//1    8    9   10  11  12  13  14            1    8    9   10  11  12  13  14
//2    15   16  17  18  19  20  21       =>   2    15   16  17  18  19  20  21
//3    22   23  24  25  26  27  28            3    22   23  24  25  26  27  28
//4    29   30  31  32  33  34  35            4    29   30  31  32  33  34  35
//5    36   37  38  39  40  41  42            5    36   37  38  39  40  x   x
//6    43   44  45  46  47  48  49            6    x    x   x   x   x   x   x
//x轴
//即如上排列组合，每一个组合的可能都是1/49 ,这时候如何我们去掉任意n种组合剩下的组合的概览也是相等的，
//我们选择去掉 41 到 49的情况只剩下余下的1到 40个排列组合 即 40种情况，里面的数为 7x+y,概览相当，再对他取 除以10的余数再加1即概览相等
let rand10 = function () {
  let temp = 100;
  while (temp > 40) {
    temp = (rand7() - 1) * 7 + rand7();
  }
  return temp % 10 + 1;
};
rand10();

// 另一种解法如下
//     0    1   2   3   4   5   6  y轴             0    1   2   3   4   5   6 y轴
//0    0    1   2   3   4   5   6             0    0    1   2   3   4   x   x
//1    5    6   7   8   9   10  11            1    5    6   7   8   9   x  x
//2    10   11  12  13  14  15  16       =>   2    10   11  12  13  14  x  x
//3    15   16  17  18  19  20  21            3    15   16  17  18  19  x  x
//4    20   21  22  23  24  25  26            4    20   21  22  23  24  x  x
//5    25   26  27  28  29  30  31            5    25   26  27  28  29  x  x
//6    30   31  32  33  34  35  36            6    x    x   x   x   x   x  x
//即去除了y>4的情况和x>5的情况，留下30种除10 余 0到9的情况 里面数为5x+y
let randTen = function () {
  let a , b;
  while(true){
    a = rand7() - 1;
    b = rand7() - 1;
    if(a > 5 || b > 4){
      continue;
    }
    return (a * 5 + b) % 10 + 1;
  }
};
randTen();